---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExtElemChangeBeamSectionRegistry Properties
ExtElemChangeBeamSectionRegistry Class See Also Send Feedback
---

The ExtElemChangeBeamSectionRegistry type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

ExtElemChangeBeamSectionRegistry Class

Autodesk.Revit.DB.Structure Namespace